---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthIn
source: html/fc93ac37-fbb3-ac92-b1c5-bca5fd5d26bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthIn Property

"Main Primary Width"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartWidthIn { get; }
```